ХМНПФ_Общее/Reports/ХМ_СверкаНеФинансовыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ХМ_СверкаНеФинансовыхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>выбОперацияНПО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ОперацияНПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СрокиПеререгистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СрокиПеререгистрации</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСледующейПеререгистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ЛицевыеСчетаУчастников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ЛицевыеСчетаУчастников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/хм_ПерваяВыплатаНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>хм_ПерваяВыплатаНПО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодНачисленияПервойВыплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_СчетчикНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СчетчикНачислений</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_КоличествоНазначенныхВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_КоличествоНазначенныхВыплат</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ДатыОкончанияСрочнойВыплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ДатыОкончанияСрочнойВыплаты</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияСрочнойВыплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/хм_СрезСчетчикНачисленийНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>хм_СрезСчетчикНачисленийНПО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПериодичностьВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПериодичностьВыплат</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодичностьВыплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Reports/ХМ_СверкаНеФинансовыхПоказателей/Ext/ObjectModule.bsl
// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.РазрешеноРедактироватьСхему = Истина;
	
КонецПроцедуры

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("");

	ИмяОтчета = Метаданные().Представление();

	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", ИмяОтчета);
	ПараметрыРегистрации.Вставить("Версия", "1.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Информация", "Дополнительный отчет");

	ТаблицаКоманд = ПолучитьТаблицуКоманд();

	ДобавитьКоманду(ТаблицаКоманд, ИмяОтчета, Метаданные().ПолноеИмя(), "ОткрытиеФормы", Истина);

	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);

	Возврат ПараметрыРегистрации;
	
КонецФункции  

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура УстановитьДатуПеререгистрации(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	
	Если СтрокаПравилСервер = Неопределено Тогда
		СтрокаПравилСервер = Новый Структура("ОчиститьДвижения,ДополнитьДвижения",Ложь,Ложь);		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.уп_СрокиПеререгистрации.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(ОперацияНПОСсылка);
	Если СтрокаПравилСервер.ОчиститьДвижения Тогда
		НаборЗаписей.Очистить();  
		НаборЗаписей.Записать(); 
		Возврат
	КонецЕсли;	

	Если СтрокаПравилСервер.ДополнитьДвижения Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли;
	
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Если Не ЗначениеЗаполнено(Строка.ТекСостояниеDOC_REREG) Тогда
			Продолжить;
		КонецЕсли;     
		нСтр= НаборЗаписей.Добавить();
		нСтр.Активность = Истина; 
		нСтр.Период     =  ОперацияНПОСсылка.Дата;
		нСтр.Регистратор = ОперацияНПОСсылка;
		
		нСтр.НомерСчета = Строка.НомерСчета;
		нСтр.ДатаСледующейПеререгистрации = Строка.ТекСостояниеDOC_REREG;  
	КонецЦикла;

	НаборЗаписей.Записать();
КонецПроцедуры

Процедура НеФ_1С_Каспер_ДатаПеререгистрации_Максимум(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	
	Если СтрокаПравилСервер = Неопределено Тогда
		СтрокаПравилСервер = Новый Структура("ОчиститьДвижения,ДополнитьДвижения",Ложь,Ложь);		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.уп_СрокиПеререгистрации.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(ОперацияНПОСсылка);
	Если СтрокаПравилСервер.ОчиститьДвижения Тогда
		НаборЗаписей.Очистить();  
		НаборЗаписей.Записать(); 
		Возврат
	КонецЕсли;	

	Если СтрокаПравилСервер.ДополнитьДвижения Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли;
	
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Если Не ЗначениеЗаполнено(Строка.ТекСостояниеВЫП_DOC_REREG) Тогда
			Продолжить;
		КонецЕсли;     
		нСтр= НаборЗаписей.Добавить();
		нСтр.Активность = Истина; 
		нСтр.Период     =  ОперацияНПОСсылка.Дата;
		нСтр.Регистратор = ОперацияНПОСсылка;
		
		нСтр.НомерСчета = Строка.НомерСчета;
		нСтр.ДатаСледующейПеререгистрации = Строка.ТекСостояниеВЫП_DOC_REREG;  
	КонецЦикла;

	НаборЗаписей.Записать();
КонецПроцедуры

Процедура УстановитьЛицевыеСчета(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Если СтрокаПравилСервер = Неопределено Тогда
		СтрокаПравилСервер = Новый Структура("ОчиститьДвижения,ДополнитьДвижения",Ложь,Ложь);		
	КонецЕсли;
	
	Организация =Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО");
    	
	НаборЗаписей = РегистрыСведений.уп_ЛицевыеСчетаУчастников.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(ОперацияНПОСсылка);
	Если СтрокаПравилСервер.ОчиститьДвижения Тогда
		НаборЗаписей.Очистить();  
		НаборЗаписей.Записать(); 
		Возврат
	КонецЕсли;	

	Если СтрокаПравилСервер.ДополнитьДвижения Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли;
	Банк_ТипЛицевогоСчета = Перечисления.уп_ТипыЛицевыхСчетов.ЛицевойСчет;
	Банк_ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет; 
	
	
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
			Если Не ЗначениеЗаполнено(Строка.ДанныеЛСKU_ФормаВыплаты) Тогда
				Продолжить;
			КонецЕсли;     
			нСтр= НаборЗаписей.Добавить();
			нСтр.Активность = Истина; 
			нСтр.Период     =  ОперацияНПОСсылка.Дата;
			нСтр.Регистратор = ОперацияНПОСсылка;
			
			нСтр.Организация = Организация;
			нСтр.НомерСчета = Строка.НомерСчета;
			нСтр.Участник = Строка.НомерСчетаУчастник;
			
			нСтр.ФормаВыплаты = Строка.ДанныеЛСKU_ФормаВыплаты;
			нСтр.Банк = Строка.ДанныеЛСKU_Банк;
			нСтр.ТипЛицевогоСчета = ?(Строка.ДанныеЛСKU_ФормаВыплаты = Банк_ФормаВыплаты,Банк_ТипЛицевогоСчета,"");
			нСтр.НомерЛицевогоСчета = Строка.ДанныеЛСKU_BANK_ACC_PERS;
			нСтр.НеДействует = Ложь;

	КонецЦикла;

	НаборЗаписей.Записать();
КонецПроцедуры

Процедура УстановитьПервуюВыплату(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Для каждого СтрокаСостояний Из ДеревоНаСервере.Строки Цикл
		Для каждого Строка Из СтрокаСостояний.Строки Цикл 
			
			Если 
				Не ЗначениеЗаполнено(Строка.ДанныеОплатыРегистраторПервойВыплаты) 
				ИЛИ Не ЗначениеЗаполнено(Строка.ДанныеОплатыFIRST_PENS) 
				ИЛИ Не ЗначениеЗаполнено(Строка.ДанныеОплатыFIRST_PENS_RP_DOC_BEGIN) 
				ИЛИ Не ЗначениеЗаполнено(Строка.KU_ПериодНачисленияПервойВыплаты) 
				Тогда
				Продолжить;
			КонецЕсли;
			хм_ПерваяВыплатаНПО = РегистрыСведений.хм_ПерваяВыплатаНПО.СоздатьНаборЗаписей();
			хм_ПерваяВыплатаНПО.Отбор.Регистратор.Установить(Строка.ДанныеОплатыРегистраторПервойВыплаты);

			нСтр = хм_ПерваяВыплатаНПО.Добавить();
			нСтр.Активность = Истина; 
			нСтр.Регистратор = Строка.ДанныеОплатыРегистраторПервойВыплаты;
			
			нСтр.НомерСчета = Строка.НомерСчета;
			нСтр.Участник = Строка.НомерСчетаУчастник;
			нСтр.ПенсионныйДоговор = Строка.НомерСчетаВладелец;

			нСтр.ПериодНачисленияПервойВыплаты = Строка.KU_ПериодНачисленияПервойВыплаты;
			нСтр.Начислено = Строка.ДанныеОплатыFIRST_PENS;
			хм_ПерваяВыплатаНПО.Записать();
			
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура УстановитьСрочныеВыплаты(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	Если СтрокаПравилСервер = Неопределено Тогда
		СтрокаПравилСервер = Новый Структура("ОчиститьДвижения,ДополнитьДвижения",Ложь,Ложь);		
	КонецЕсли;
		
	уп_СчетчикНачислений = РегистрыНакопления.уп_СчетчикНачислений.СоздатьНаборЗаписей();
	уп_СчетчикНачислений.Отбор.Регистратор.Установить(ОперацияНПОСсылка);
	уп_КоличествоНазначенныхВыплат = РегистрыСведений.уп_КоличествоНазначенныхВыплат.СоздатьНаборЗаписей();
	уп_КоличествоНазначенныхВыплат.Отбор.Регистратор.Установить(ОперацияНПОСсылка);
	уп_ДатыОкончанияСрочнойВыплаты = РегистрыСведений.уп_ДатыОкончанияСрочнойВыплаты.СоздатьНаборЗаписей();
	уп_ДатыОкончанияСрочнойВыплаты.Отбор.Регистратор.Установить(ОперацияНПОСсылка);
	хм_СрезСчетчикНачисленийНПО = РегистрыСведений.хм_СрезСчетчикНачисленийНПО.СоздатьНаборЗаписей();
	хм_СрезСчетчикНачисленийНПО.Отбор.Регистратор.Установить(ОперацияНПОСсылка);

	Если СтрокаПравилСервер.ОчиститьДвижения Тогда
		хм_СрезСчетчикНачисленийНПО.Очистить();  
		хм_СрезСчетчикНачисленийНПО.Записать(); 
		уп_СчетчикНачислений.Очистить();  
		уп_СчетчикНачислений.Записать(); 
		уп_КоличествоНазначенныхВыплат.Очистить();  
		уп_КоличествоНазначенныхВыплат.Записать(); 
		уп_ДатыОкончанияСрочнойВыплаты.Очистить();  
		уп_ДатыОкончанияСрочнойВыплаты.Записать(); 
		Возврат
	КонецЕсли;	
	Если СтрокаПравилСервер.ДополнитьДвижения Тогда
		хм_СрезСчетчикНачисленийНПО.Прочитать();
		уп_СчетчикНачислений.Прочитать();
		уп_КоличествоНазначенныхВыплат.Прочитать();
		уп_ДатыОкончанияСрочнойВыплаты.Прочитать();
	КонецЕсли;

	Для каждого СтрокаСостояний Из ДеревоНаСервере.Строки Цикл
    
		Для каждого Строка Из СтрокаСостояний.Строки Цикл
			
			Если Не ЗначениеЗаполнено(Строка.ВыплатНазначено) 
				ИЛИ  Не ЗначениеЗаполнено(Строка.ТекСостояниеDOC_DOC_Z_DATE_REREG) 
				Тогда
				Продолжить;
			КонецЕсли;     
			
			нСтр = хм_СрезСчетчикНачисленийНПО.Добавить();
			нСтр.Активность = Истина; 
			нСтр.Период     =  ОперацияНПОСсылка.Дата;
			нСтр.Регистратор = ОперацияНПОСсылка;
				
			нСтр.НомерСчета = Строка.НомерСчета;
			нСтр.Количество = Строка.ВсегоВыплачено;
			нСтр.ДатаУстановкиСостояния = нСтр.Период;
			
			Если Не Строка.ВыплатНазначено - Строка.ТекСостояниеВсегоВыплатНазначено = 0 Тогда
				нСтр = уп_КоличествоНазначенныхВыплат.Добавить();
				нСтр.Активность = Истина; 
				нСтр.Период     =  ОперацияНПОСсылка.Дата;
				нСтр.Регистратор = ОперацияНПОСсылка;
				
				нСтр.НомерСчета = Строка.НомерСчета;
				нСтр.КоличествоВыплат = Строка.ВыплатНазначено;
			КонецЕсли;
           
			Если Не Строка.ТекСостояниеДатаОкончанияСрочнойВыплаты = Строка.ТекСостояниеDOC_DOC_Z_DATE_REREG Тогда
				нСтр = уп_ДатыОкончанияСрочнойВыплаты.Добавить();
				нСтр.Активность = Истина; 
				нСтр.Период     =  ОперацияНПОСсылка.Дата;
				нСтр.Регистратор = ОперацияНПОСсылка;
				
				нСтр.НомерСчета = Строка.НомерСчета;
				нСтр.ДатаОкончанияСрочнойВыплаты = Строка.ТекСостояниеDOC_DOC_Z_DATE_REREG;
			КонецЕсли;
 		
		КонецЦикла;
	КонецЦикла;

	хм_СрезСчетчикНачисленийНПО.Записать();
	уп_СчетчикНачислений.Записать();
	уп_КоличествоНазначенныхВыплат.Записать();
	уп_ДатыОкончанияСрочнойВыплаты.Записать();
КонецПроцедуры

Процедура УстановитьСхемуВыплат(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	
	Если СтрокаПравилСервер = Неопределено Тогда
		СтрокаПравилСервер = Новый Структура("ОчиститьДвижения,ДополнитьДвижения",Ложь,Ложь);		
	КонецЕсли;
		
	НаборЗаписей = РегистрыСведений.уп_СхемаСчета.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(ОперацияНПОСсылка);
	Если СтрокаПравилСервер.ОчиститьДвижения Тогда
		НаборЗаписей.Очистить();  
		НаборЗаписей.Записать(); 
		Возврат
	КонецЕсли;	

	Если СтрокаПравилСервер.ДополнитьДвижения Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли;
	
	Для каждого СтрокаСостояний Из ДеревоНаСервере.Строки Цикл
		Для каждого Строка Из СтрокаСостояний.Строки Цикл
			Если Не ЗначениеЗаполнено(Строка.KU_СхемаВыплатыСхема) 
				ИЛИ Не ЗначениеЗаполнено(Строка.KU_СхемаВыплатыВерсияПенсионныхПравил) Тогда
				Продолжить;
			КонецЕсли;     
			нСтр= НаборЗаписей.Добавить();
			нСтр.Активность = Истина; 
			нСтр.Период     =  ОперацияНПОСсылка.Дата;
			нСтр.Регистратор = ОперацияНПОСсылка;
			
			нСтр.НомерСчета = Строка.НомерСчета;
			нСтр.Схема = Строка.KU_СхемаВыплатыСхема;  

			нСтр.ТипПенсии = ?(ЗначениеЗаполнено(Строка.KU_СхемаВыплатыТипСхемы),Строка.KU_СхемаВыплатыТипСхемы,Строка.KU_СхемаВыплатыСхемаТипПенсионнойСхемы);  
			нСтр.ВерсияПенсионныхПравил = Строка.KU_СхемаВыплатыВерсияПенсионныхПравил;  
		КонецЦикла;
	КонецЦикла;

	НаборЗаписей.Записать();
КонецПроцедуры

Процедура УстановитьПериодичность(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли; 
	
	Если СтрокаПравилСервер = Неопределено Тогда
		СтрокаПравилСервер = Новый Структура("ОчиститьДвижения,ДополнитьДвижения",Ложь,Ложь);		
	КонецЕсли;
		
	НаборЗаписей = РегистрыСведений.уп_ПериодичностьВыплат.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(ОперацияНПОСсылка);
	
	Если СтрокаПравилСервер.ОчиститьДвижения Тогда
		НаборЗаписей.Очистить();  
		НаборЗаписей.Записать(); 
		Возврат
	КонецЕсли;	
    
	Если СтрокаПравилСервер.ДополнитьДвижения Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли;
	
	Для каждого СтрокаСостояний Из ДеревоНаСервере.Строки Цикл
		Для каждого Строка Из СтрокаСостояний.Строки Цикл
			Если НЕ ЗначениеЗаполнено(Строка.KU_ПериодичностьПериодичностьВыплат) Тогда
				Продолжить;
			КонецЕсли;
			
			нСтр= НаборЗаписей.Добавить();
			нСтр.Активность = Истина; 
			нСтр.Период     =  ОперацияНПОСсылка.Дата;
			нСтр.Регистратор = ОперацияНПОСсылка;
			
			нСтр.НомерСчета = Строка.НомерСчета;
			нСтр.ПериодичностьВыплат = Строка.KU_ПериодичностьПериодичностьВыплат;  
			нСтр.НомерМесяцаВПериоде = Строка.KU_ПериодичностьНомерМесяцаВПериоде;  
					
		КонецЦикла;
	КонецЦикла;

	НаборЗаписей.Записать();
КонецПроцедуры 

Процедура УстановитьРазмерПенсии(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	Если СтрокаПравилСервер = Неопределено Тогда
		СтрокаПравилСервер = Новый Структура("ОчиститьДвижения,ДополнитьДвижения",Ложь,Ложь);		
	КонецЕсли;
		
	НаборЗаписей = РегистрыСведений.уп_РазмерПенсии.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(ОперацияНПОСсылка);

	Если СтрокаПравилСервер.ОчиститьДвижения Тогда
		НаборЗаписей.Очистить();  
		НаборЗаписей.Записать(); 
		Возврат
	КонецЕсли;	

	Если СтрокаПравилСервер.ДополнитьДвижения Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли;
	
	Для каждого СтрокаСостояний Из ДеревоНаСервере.Строки Цикл
		Для каждого Строка Из СтрокаСостояний.Строки Цикл
			нСтр= НаборЗаписей.Добавить();
			нСтр.Активность = Истина; 
			нСтр.Период     =  ОперацияНПОСсылка.Дата;  
			нСтр.Регистратор = ОперацияНПОСсылка;
			
			нСтр.НомерСчета = Строка.НомерСчета;
			нСтр.Размер = Строка.ДанныеОплатыPENS_VAL;  
		КонецЦикла;
	КонецЦикла;

	НаборЗаписей.Записать();
КонецПроцедуры 

Процедура УстановитьСостояниеПСнаВчерашнийДень(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	
	Если СтрокаПравилСервер = Неопределено Тогда
		СтрокаПравилСервер = Новый Структура("ОчиститьДвижения,ДополнитьДвижения",Ложь,Ложь);		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.уп_СостоянияПС.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(ОперацияНПОСсылка);  
	
	Если СтрокаПравилСервер.ОчиститьДвижения Тогда
		НаборЗаписей.Очистить();  
		НаборЗаписей.Записать(); 
		Возврат;
	КонецЕсли;
	
	Если СтрокаПравилСервер.ДополнитьДвижения Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли; 
	
	Для каждого СтрокаСостояний Из ДеревоНаСервере.Строки Цикл
		Для каждого Строка Из СтрокаСостояний.Строки Цикл
			Если Не ЗначениеЗаполнено(Строка.ТекСостояниеDOC_СостояниеПС) Тогда
				Продолжить;
			КонецЕсли;     
			Если Не ЗначениеЗаполнено(Строка.НомерСчета) Тогда
				Продолжить;
			КонецЕсли;     
			
			нСтр = НаборЗаписей.Добавить();
			нСтр.Активность = Истина; 
			нСтр.Период     =  ОперацияНПОСсылка.Дата;
			нСтр.Регистратор = ОперацияНПОСсылка;
			
			нСтр.НомерСчета = Строка.НомерСчета;
			нСтр.Состояние = Строка.ТекСостояниеDOC_СостояниеПС;  
			нСтр.ДатаУстановкиСостояния = Строка.ТекСостояниеDOC_RP_DOC_BEGIN; 
			нСтр.ДатаОкончанияОснований = Строка.ТекСостояниеDOC_ДатаОкончанияОснований;
			нСтр.Основание = Строка.ТекСостояниеDOC_Основание;
			нСтр.Расшифровка = Строка.ТекСостояниеDOC_РасшифровкаСостоянияПС;
		КонецЦикла;
		Если Не ЗначениеЗаполнено(СтрокаСостояний.ТекСостояниеDOC_СостояниеПС) Тогда
			Продолжить;
		КонецЕсли;     
		Если Не ЗначениеЗаполнено(СтрокаСостояний.НомерСчета) Тогда
			Продолжить;
		КонецЕсли;     
		
		нСтр = НаборЗаписей.Добавить();
		нСтр.Активность = Истина; 
		нСтр.Период     =  ОперацияНПОСсылка.Дата;
		нСтр.Регистратор = ОперацияНПОСсылка;
		
		нСтр.НомерСчета = СтрокаСостояний.НомерСчета;
		нСтр.Состояние = СтрокаСостояний.ТекСостояниеDOC_СостояниеПС;  
		нСтр.ДатаУстановкиСостояния = СтрокаСостояний.ТекСостояниеDOC_RP_DOC_BEGIN;
		нСтр.ДатаОкончанияОснований = СтрокаСостояний.ТекСостояниеDOC_ДатаОкончанияОснований;
		нСтр.Основание = СтрокаСостояний.ТекСостояниеDOC_Основание;
		нСтр.Расшифровка = СтрокаСостояний.ТекСостояниеDOC_РасшифровкаСостоянияПС;
	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры
